app/Http/Controllers/CartItemUserController.php

SELECT * FROM `sender_addresses` WHERE `sender_addresses`.`id` = 1 LIMIT 1
---
        // echo "sender address : ";
        // print_r(($senderIdAddr));
        // echo "<br>";
        $senderAddress = SenderAddress::whereIn('id', $senderIdAddr)->get();