app/Http/Controllers/CartItemUserController.php

SELECT * FROM `product_variants` WHERE `id` = '1' LIMIT 1
---
    public function store(Request $request)
    {
        // dd($request);

        if ($request->sender_address_id == 0) {
            return redirect()->back()->with('failed', 'Pilih alamat pengirim terlebih dahulu');
        }

        if (!empty($request->product_variant_id)) {
            $productVariantCheck = ProductVariant::where('id', '=', $request->product_variant_id)->first();

SELECT * FROM `cart_items` WHERE (`product_id` = '1' and `product_variant_id` = '1' and `is_checkout_view` = '0' and `user_id` = 5) and `cart_items`.`deleted_at` IS NULL LIMIT 1
---
                // 'subtotal.required' => 'Pilih varian produk terlebih dahulu',
            ]
        );
        $found = CartItem::where([['product_id', '=', $request->product_id], ['product_variant_id', '=', $request->product_variant_id], ['is_checkout_view', '=', '0'], ['user_id', '=', auth()->user()->id]])->first();

INSERT INTO `cart_items` (`user_id`, `product_id`, `product_variant_id`, `quantity`, `subtotal`, `sender_address_id`, `updated_at`, `created_at`) VALUES ('5', '1', '1', '1', '51000', '1', '2022-10-24 14:27:54', '2022-10-24 14:27:54')
---
                return redirect()->back()->with('failed', 'Terdapat kesalahan saat menambahkan produk ke keranjang, mohon pastikan memilih varian produk atau mengisi alamat dengan benar');
            }
        } else {
            $create = CartItem::create($validatedData);

SELECT * FROM `cart_items` WHERE `id` in ('17', ) and `cart_items`.`deleted_at` IS NULL
UPDATE `cart_items` SET `is_checkout_view` = 1, `cart_items`.`updated_at` = '2022-10-24 15:28:24' WHERE `id` = 17
---

        $request->session()->put(['ids' => $request->ids]);
        // $ids = session()->get('ids');
        $checkout_items = CartItem::whereIn('id', $request->ids)->get()->sortByDesc('created_at');
        foreach ($checkout_items as $item) {
            echo $item;
            $item->is_checkout_view = 1;
            $item->save();

SELECT * FROM `product_promos` WHERE `product_id` in (6)
SELECT * FROM `product_promos` WHERE `product_promos`.`promo_id` in (2, 4, 5, 6, 7, 8, 12, 13)
SELECT * FROM `promo_payment_methods` WHERE `promo_payment_methods`.`promo_id` in (2, 4, 5, 6, 7, 8, 12, 13)
SELECT * FROM `promo_types` WHERE `promo_types`.`id` in (1, 2, 3, 4)
SELECT * FROM `promos` WHERE `is_active` = 1
---
    public function checkoutView(Request $request)
    {
        // dd($request);
        $items = session()->get('items');
        // dd($items);
        // foreach ($items as $item) {
        //     // echo $item;
        //     // print_r($item->product->productpromo);
        //     foreach ($item->product->productpromo as $productpromo) {
        //         print_r($productpromo->promo);
        //     }
        // }
        // dd($items);
        // dd($items[0]->product);
        if (session()) {
            if (!isset($items)) {
                return redirect()->route('home');
            }
        }
        if (is_null($items)) {
            return redirect()->route('cart.index')->with('failed', 'Terdapat kesalahan saat melakukan checkout pesanan, silakan coba lagi');
        }else{
            $productIds = $items->pluck('product_id');
            $productPromo = ProductPromo::whereIn('product_id', $productIds)->get();
            $productPromoGroup = $productPromo->groupBy('promo_id');
            $promos = Promo::where('is_active', '=', 1)->with('productPromo', 'PromoPaymentMethod', 'promoType')->get();

SELECT * FROM `payment_methods` WHERE `is_active` = 1
---
        // }
        // dd($productPromo->groupBy('promo_id'));

        $paymentMethods = PaymentMethod::where('is_active', '=', 1)->get();

SELECT * FROM `user_addresses` WHERE `user_addresses`.`user_id` = 5 and `user_addresses`.`user_id` IS not NULL
SELECT * FROM `sender_addresses` WHERE `id` in (1, 2)
---
        // echo "sender address : ";
        // print_r(($senderIdAddr));
        // echo "<br>";
        $senderAddress = SenderAddress::whereIn('id', $senderIdAddr)->get();

SELECT `name`, `province_id` FROM `provinces`
---
            'title' => 'Checkout',
            'items' => $items,
            'userAddress' => auth()->user()->useraddress,
            'provinces' => Province::pluck('name', 'province_id'),