app/Http/Controllers/ForgotPasswordController.php

    public function forgotPasswordResetPost(Request $request)
    {
        // mengambil data user dari database
        $user = User::find(session()->get('user_id'));

        //checking password yang dimasukkan apakah sama dengan password sebelumnya yang ada di database
        if (Hash::check($request->password, $user->password)) {
            return back()->with('resetFailed', 'Password tidak boleh sama dengan password sebelumnya');
        }else{
            $request->merge(['passwordRetype' => $request->passwordRetype]);
            $validatedData = $request->validate(
                [
                    'password' => 'required|min:5|max:255',
                    'passwordRetype' => 'same:password'
                ],
                [
                    'password.min' => 'password minimal 5 karakter',
                    'password.required' => 'password harus diisi!',
                    'passwordRetype.same' => 'Password yang diketikkan tidak cocok, pastikan kembali password yang diketikkan sama'
                ]
            );
            $validatedData['password'] = Hash::make($validatedData['password']);
            // dd($validatedData);
            $new_pass = ['password'=> $validatedData['password']];
            if($user->update(['password'=> $validatedData['password']])){
---
SELECT * FROM `users` WHERE `users`.`id` = 6 LIMIT 1
UPDATE `users` SET `password` = '$2y$10$AZA/swz7OQHFH1.5PlBlC.SYnjdpH9iF0FY1/05vvDiR06XBpC7ly', `users`.`updated_at` = '2022-11-25 14:36:09' WHERE `id` = 6