app/Http/Controllers/IndexController.php

SELECT `products`.*, (SELECT avg(star) FROM `product_comments` WHERE `star` != '0' and `product_id` = `products`.`id`) as `star` FROM `products` WHERE `is_active` = 1 ORDER BY `created_at` DESC LIMIT 24
SELECT `products`.*, (SELECT avg(star) FROM `product_comments` WHERE `star` != '0' and `product_id` = `products`.`id`) as `star` FROM `products` WHERE `is_active` = 1 ORDER BY `sold` DESC LIMIT 24
SELECT `products`.*, (SELECT avg(star) FROM `product_comments` WHERE `star` != '0' and `product_id` = `products`.`id`) as `star` FROM `products` WHERE `is_active` = 1 ORDER BY (SELECT avg(star) FROM `product_comments` WHERE `star` != '0' and `product_id` = `products`.`id`) DESC LIMIT 24
SELECT * FROM `promo_banners` WHERE `is_active` = 1 and `start_period` <= '2022-11-26 12:16:24' and `end_period` >= '2022-11-26 12:16:24' ORDER BY `id` DESC
---
    public function index()
    {
        $this->promoBannerExpiredCheck();
        $this->promoVoucherExpiredCheck();

        $productsLatest = Product::where('is_active', '=', 1)->with('productcomment')->addSelect(['star'=> ProductComment::selectRaw('avg(star)')->where('star','!=','0')->whereColumn('product_id','products.id')])->latest()->take(24)->get();
        $productsBestSeller =  Product::where('is_active', '=', 1)->with('productcomment')->addSelect(['star'=> ProductComment::selectRaw('avg(star)')->where('star','!=','0')->whereColumn('product_id','products.id')])->orderBy('sold', 'desc')->take(24)->get();
        // Product::where('is_active', '=', 1)->with('productcomment')->orderBy('sold', 'desc')->take(24)->get();
        $productsStar =  Product::where('is_active', '=', 1)->with('productcomment')->addSelect(['star'=> ProductComment::selectRaw('avg(star)')->where('star','!=','0')->whereColumn('product_id','products.id')])->orderByDesc(ProductComment::selectRaw('avg(star)')->where('star','!=','0')->whereColumn('product_id','products.id'))->take(24)->get();
        // $productsStar =  Product::where('is_active', '=', 1)->with('productcomment')->get()->sortByDesc(function ($products) {
        //     return $products->productComment->avg('star');
        // })->take(24);
        $promoBanner = PromoBanner::where('is_active', '=', 1)->where('start_period', '<=', Carbon::now())->where('end_period', '>=', Carbon::now())->orderBy("id", "desc")->get();

SELECT * FROM `product_merks` LIMIT 12
---

        // dd($promosStar);

        $merksIndex = ProductMerk::take(12)->get();

SELECT * FROM `promo_banners`
---
    public function promoBannerExpiredCheck()
    {
        $expiredCheck = PromoBanner::all();

SELECT * FROM `promos`
---
    public function promoVoucherExpiredCheck()
    {
        $expiredCheck = Promo::all();