app/Http/Controllers/MerkController.php

    public function index()
    {
        // dd($category);
        return view('categoriesMerks',[
            'title' => 'E-commerce resmi CV. SARANA PRIMA LESTARI | Product',
			"page" => 'Merk',
			"imgSource" => '',
            "queries" => ProductMerk::all(),
---
SELECT * FROM `product_merks`

    public function show(ProductMerk $merk)
    {
        return view('productCategoriesMerks',[
            'title' => 'E-commerce resmi CV. SARANA PRIMA LESTARI | Product',
            'page' => 'Merk',
			"var" => $merk,
            "products" => Product::where('product_merk_id',$merk->id)->paginate(12),
            // "products" => Product::paginate(12),
            "queries" => ProductMerk::all(),
---
SELECT * FROM `products` WHERE `product_merk_id` = 14 LIMIT 12 offset 0
SELECT count(*) as aggregate FROM `products` WHERE `product_merk_id` = 14
SELECT * FROM `product_merks`