app/Http/Controllers/OrderController.php

SELECT * FROM `orders` WHERE `id` = '18' LIMIT 1
SELECT * FROM `order_items` WHERE `order_items`.`order_id` = 18 and `order_items`.`order_id` IS not NULL
SELECT * FROM `order_products` WHERE `order_products`.`id` = 3 LIMIT 1
SELECT * FROM `orders` WHERE `id` = '18'
SELECT * FROM `order_products` WHERE `id` in (3)
---
    public function orderDetailBind($id)
    {
        $id = Crypt::decrypt($id);
        $this->expiredCheck();

        $outStock = null;
        // dd($order->id);
        $order = Order::withTrashed()->where('id', $id)->first();
        foreach ($order->orderitem as $item) {
            $orderProductIds[] = $item->orderproduct->id;
        }
        $orders = Order::withTrashed()->where('id', $id)->get();
        // dd($orders);
        $orderItems = $order->orderitem;
        $orderProducts = OrderProduct::whereIn('id', $orderProductIds)->get();

SELECT * FROM `orders` WHERE `user_id` = 5 ORDER BY `created_at` DESC
---
    public function expiredCheck()
    {
        $now = Carbon::now();

        $orders = Order::where('user_id', '=', auth()->user()->id)->withTrashed()->orderByDesc('created_at')->get();

SELECT * FROM `cart_items` WHERE (`user_id` = 5 and `product_id` = 17 and `product_variant_id` = 0 and `quantity` = 1 and `subtotal` = 38790 and `deleted_at` like '%2022-11-22 09:40%' and `updated_at` like '%2022-11-22 09:40%') LIMIT 1
---
                            // echo "order item product variant id: " . $orderItem->product_variant_id;
                            // echo "<br><br>";

                            $cartItem = CartItem::where([['user_id', '=', auth()->user()->id], ['product_id', '=', $orderItem->product_id], ['product_variant_id', '=', $orderItem->product_variant_id], ['quantity', '=', $orderItem->quantity], ['subtotal', '=', $orderItem->total_price_item], ['deleted_at', 'like', '%' . Carbon::parse($orderItem->created_at)->format('Y-m-d H:i') . '%'], ['updated_at', 'like', '%' . Carbon::parse($orderItem->created_at)->format('Y-m-d H:i') . '%']])->withTrashed()->first();

SELECT * FROM `orders` WHERE `orders`.`id` = '36' and `orders`.`deleted_at` IS NULL LIMIT 1
SELECT * FROM `order_items` WHERE `order_items`.`order_id` = 36 and `order_items`.`order_id` IS not NULL
UPDATE `order_items` SET `order_item_status` = 'pesanan dibatalkan', `order_items`.`updated_at` = '2022-11-24 15:22:20' WHERE `id` = 45
INSERT INTO `order_status_details` (`order_id`, `status`, `status_detail`, `status_date`, `updated_at`, `created_at`) VALUES (36, 'Pesanan Dibatalkan', 'Pesanan Dibatalkan. Alasan pembatalan: Stok habis pada item yang dipesan, silakan hubungi admin KLIKSPL melalui menu customer care apabila anda sudah melakukan pembayaran', '2022-11-24 15:22:20', '2022-11-24 15:22:20', '2022-11-24 15:22:20')
UPDATE `orders` SET `order_status` = 'pesanan dibatalkan', `orders`.`updated_at` = '2022-11-24 15:22:20' WHERE `id` = 36
---
    public function stockCheckBeforePayment($order_id)
    {
        // dd($request);
        $outStock = null;
        $status = null;
        $order = Order::findOrFail($order_id);
        foreach ($order->orderItem as $item) {
            $item->order_item_status = 'pesanan dibatalkan';
            if (!empty($item->product_variant_id)) {
                $variant = $item->productvariant;
                if ($item->quantity > $variant->stock) {
                    $item->order_item_status = 'stok habis';
                    $status = 'Stok habis di salah satu item yang dipesan';
                    $outStock = 1;
                }
            } else {
                $product = $item->product;
                if ($item->quantity > $product->stock) {
                    $item->order_item_status = 'stok habis';
                    $status = 'Stok habis pada item yang dipesan';
                    $outStock = 1;
                }
            }
            $item->save();
        }
        if (!empty($outStock)) {
            $orderStatus = OrderStatusDetail::create(
                [
                    'order_id' => $order->id,
                    'status' => 'Pesanan Dibatalkan',
                    'status_detail' => 'Pesanan Dibatalkan. Alasan pembatalan: ' . $status. ', silakan hubungi admin KLIKSPL melalui menu customer care apabila anda sudah melakukan pembayaran',
                    'status_date' => date('Y-m-d H:i:s')
                ]
            );
            $order->order_status = 'pesanan dibatalkan';
            $order->save();

SELECT * FROM `orders` WHERE `orders`.`id` = '22' and `orders`.`deleted_at` IS NULL LIMIT 1
UPDATE `orders` SET `order_status` = 'selesai', `orders`.`updated_at` = '2022-11-24 14:48:49' WHERE `id` = 22
SELECT * FROM `order_items` WHERE `order_items`.`order_id` = 22 and `order_items`.`order_id` IS not NULL
UPDATE `order_items` SET `order_item_status` = 'selesai', `order_items`.`updated_at` = '2022-11-24 14:48:49' WHERE `id` = 30
INSERT INTO `order_status_details` (`order_id`, `status`, `status_detail`, `status_date`, `updated_at`, `created_at`) VALUES (22, 'selesai', 'Pesanan sudah diterima pada 24 November 2022, 14:48 WIB', '2022-11-24 14:48:49', '2022-11-24 14:48:49', '2022-11-24 14:48:49')
---
    public function confirmOrder(Request $request)
    {
        $request->merge(['id' => $request->orderId]);

        $validatedData = $request->validate(
            [
                'id' => 'required'
            ],
            [
                'id.required' => 'Pilih pesanan yang akan dikonfirmasi'
            ]
        );

        $order = Order::find($validatedData['id']);
        $order->order_status = 'selesai';
        $OrderDelivered = $order->save();

        if ($OrderDelivered) {
            foreach ($order->orderitem as $item) {
                $item->order_item_status = 'selesai';
                $item->save();
            }
        }
        $orderStatus = OrderStatusDetail::create(
            [
                'order_id' => $order->id,
                'status' => 'selesai',
                'status_detail' => 'Pesanan sudah diterima pada ' . Carbon::now()->isoFormat('D MMMM Y, HH:mm') . ' WIB',
                'status_date' => date('Y-m-d H:i:s')
            ]
        );