app/Http/Controllers/OrderController.php

    public function index(Request $request)
    {
        $this->expiredCheck();
        // dd(request(['status'])['status']);

        if (empty(request(['status'])['status'])) {
            $request->request->add(['status' => '']);
        }

        if (request(['status'])['status'] == '') {
            $header = 'Semua Pesanan';
        } else if (request(['status'])['status'] == 'belum bayar') {
            $header = 'Pesanan Belum Dibayar';
        } else if (request(['status'])['status'] == 'pesanan dibayarkan') {
            $header = 'Pesanan Menunggu Verifikasi';
        } else if (request(['status'])['status'] == 'pesanan disiapkan') {
            $header = 'Pesanan Disiapkan';
        } else if (request(['status'])['status'] == 'pesanan dikirim') {
            $header = 'Pesanan Dikirim';
        } else if (request(['status'])['status'] == 'selesai') {
            $header = 'Pesanan Selesai';
        } else if (request(['status'])['status'] == 'expired') {
            $header = 'Pesanan Dibatalkan';
        } else if (request(['status'])['status'] == 'pesanan dibatalkan') {
            $header = 'Pesanan Dibatalkan';
        } else {
            return redirect()->route('order.index');
        }
        $orders =  Order::where('user_id', '=', auth()->user()->id)->withTrashed()->with(['orderitem', 'orderstatusdetail'])->orderByDesc('created_at')->filter(request(['status']))->get();
---
SELECT * FROM `order_items` WHERE `order_items`.`order_id` in (1, 2, 3)
SELECT * FROM `order_status_details` WHERE `order_status_details`.`order_id` in (1, 2, 3)
SELECT * FROM `orders` WHERE `user_id` = 5 ORDER BY `created_at` DESC

    public function store(Request $request)
    {
        // dd($request);

        $request->session()->put(['courier' => $request->courier]);
        $request->session()->put(['courier_package_type' => $request->courier_package_type]);
        $request->session()->put(['estimation' => $request->estimation]);
        $request->session()->put(['courier_price' => $request->courier_price]);
        $request->session()->put(['sender_address_id' => $request->sender_address_id]);
        $request->session()->put(['payment_method_id' => $request->payment_method_id]);
        $request->session()->put(['checkout_total_prices' => $request->checkout_total_prices]);
        $request->session()->put(['checkout_payment_total_price' => $request->checkout_payment_total_price]);
        // dd(auth()->user());
        // dd(session()->all());

        // dd($userPromoUse);
        $discount = 0;
        // $userPromoUse = null;

        if (!is_null($request->promo_use_id)) {

            $userPromoUse = UserPromoUse::firstOrCreate(
                [
                    'user_id' => auth()->user()->id,
                    'promo_id' => $request->promo_use_id,
                ]
            );

            $promo = Promo::find($request->promo_use_id);
---
INSERT INTO `user_promo_uses` (`user_id`, `promo_id`, `updated_at`, `created_at`) VALUES (5, '13', '2022-10-24 14:38:48', '2022-10-24 14:38:48')
SELECT * FROM `user_promo_uses` WHERE (`user_id` = 5 and `promo_id` = '13') LIMIT 1
SELECT * FROM `promos` WHERE `promos`.`id` = '13' LIMIT 1

        // dd($request);

        // cek stock cart items
        $req_cart = CartItem::whereIn('id', $request->cart_ids)->get();
---
SELECT * FROM `cart_items` WHERE `id` in ('4') and `cart_items`.`deleted_at` IS NULL

        }
        // dd($request);
        // retrieve user address yang order
        $userAddress = UserAddress::where([['user_id', '=', $request->user_id], ['is_active', '=', '1']])->first();

        // membuat alamat pengiriman untuk user di table orderAddress
        // jika alamat user tidak ditemukan maka membuat alamat baru
        $orderAddress = OrderAddress::firstOrCreate(
            [
                'user_id' => $userAddress->user_id,
                'name' => $userAddress->name,
                'address' => $userAddress->address,
                'district' => $userAddress->district,
                'city_ids' => $userAddress->city_ids,
                'province_ids' => $userAddress->province_ids,
                'postal_code' => $userAddress->postal_code,
                'telp_no' => $userAddress->telp_no,
            ]
        );
---
SELECT * FROM `user_addresses` WHERE (`user_id` = '5' and `is_active` = '1') LIMIT 1
INSERT INTO `order_addresses` (`user_id`, `name`, `address`, `district`, `city_ids`, `province_ids`, `postal_code`, `telp_no`, `updated_at`, `created_at`) VALUES (5, 'Muhammad Riduan Indra Hariwijaya', 'Jl. Kasturi 1 RT32 RW07, Kel. Syamsudin Noor, Kec. Landasan Ulin, Kota Banjarbaru', '', 35, 13, 70712, '085248466297', '2022-10-24 14:26:30', '2022-10-24 14:26:30')
SELECT * FROM `order_addresses` WHERE (`user_id` = 5 and `name` = 'Muhammad Riduan Indra Hariwijaya' and `address` = 'Jl. Kasturi 1 RT32 RW07, Kel. Syamsudin Noor, Kec. Landasan Ulin, Kota Banjarbaru' and `district` = '' and `city_ids` = 35 and `province_ids` = 13 and `postal_code` = 70712 and `telp_no` = '085248466297') LIMIT 1

        ]);

        // insert order/pesanan ke dalam DB
        $order = Order::create($validatedData);
---
INSERT INTO `orders` (`user_id`, `order_address_id`, `courier`, `courier_package_type`, `estimation_day`, `estimation_date`, `courier_price`, `total_price`, `order_status`, `retur`, `unique_code`, `payment_method_id`, `payment_due_date`, `sender_address_id`, `updated_at`, `created_at`) VALUES ('5', 1, 'JNE', 'OKE (Ongkos Kirim Ekonomis)', '3', '2022-10-27 14:38:48', '6000', '46200', 'belum bayar', '0', 0, '1', '2022-10-25 14:38:48', '1', '2022-10-24 14:38:48', '2022-10-24 14:38:48')

        $statusDetail = 'batas pembayaran ' . \Carbon\Carbon::parse($order->payment_due_date)->isoFormat('dddd,D MMMM Y | HH:mm') . ' WIB';

        // insert status order ke dalam DB
        $orderStatus = OrderStatusDetail::create(
            [
                'order_id' => $orderId,
                'status' => 'Pesanan Dibuat',
                'status_detail' => $statusDetail,
                'status_date' => date('Y-m-d H:i:s')
            ]
        );
---
INSERT INTO `order_status_details` (`order_id`, `status`, `status_detail`, `status_date`, `updated_at`, `created_at`) VALUES (2, 'Pesanan Dibuat', 'batas pembayaran Selasa,25 Oktober 2022 | 14:38 WIB', '2022-10-24 14:38:48', '2022-10-24 14:38:48', '2022-10-24 14:38:48')

            // case dari CART (produk yang dipesan sudah masuk ke dalam cart items)
        } else {
            // retrieve cart items yg baru di buat dan disimpan di $items
            $items = CartItem::whereIn('id', $request->cart_ids)->with('product', 'productvariant')->get()->sortByDesc('created_at');
---
SELECT * FROM `cart_items` WHERE `id` in ('4') and `cart_items`.`deleted_at` IS NULL
SELECT * FROM `product_variants` WHERE `product_variants`.`id` in (18)
SELECT * FROM `products` WHERE `products`.`id` in (14)

            }

            // insert data orderProduct ke dalam table order product
            $orderProducts = OrderProduct::firstOrCreate($orderProduct);
---
INSERT INTO `order_products` (`name`, `specification`, `description`, `excerpt`, `slug`, `product_code`, `product_category`, `product_merk`, `variant_name`, `variant_value`, `variant_code`, `stock`, `weight`, `price`, `updated_at`, `created_at`) VALUES ('SARUNG DODOS MEREK KINGOYA [ORIGINAL] - SAFETY COVER DODOS KINGOYA', '<ul><li>Nama Produk : Safety Cover for Chisel&nbsp;</li><li>Warna : Kuning.</li><li>Material : Polypropelene.</li><li>Ukuran : Dodos 4\\" dan Dodos 5-6\\"&nbsp;</li><li>Berat : 300 gram.</li></ul>', '<div>SARUNG DODOS SAWIT MEREK KINGOYA - SAFETY COVER DODOS KINGOYA<br>⚠️⚠️ COCOK UNTUK DODOS MEREK APAPUN ASAL SESUAI UKURANNYA ⚠️⚠️<br><br>Fungsi :<br>Sarung Dodos merupakan APD dalam perkebunan kelapa sawit untuk melindungi pengguna/orang lain sehingga pengguna lebih aman ketika membawa Dodos.</div>', '<div>SARUNG DODOS MEREK KINGOYA [ORIGINAL] - SAFETY COVER DODOS KINGOYA</div>', 'sarung-dodos-merek-kingoya-original-safety-cover-dodos-kingoya', '1120', 'Alat Panen', 'Kingoya', 'Ukuran 4 Inch', 'Ukuran 4 Inch', '11201', 73, 300, 51000, '2022-10-24 14:26:32', '2022-10-24 14:26:32')

                    ];

                    // insert data order product image ke table order product image
                    $orderProductImage = OrderProductImage::create($orderProductImages);
---
INSERT INTO `order_product_images` (`order_product_id`, `name`, `updated_at`, `created_at`) VALUES (3, 'user/rdnndr/order/2/3/63564108e9706.jpg', '2022-10-24 14:38:49', '2022-10-24 14:38:49')

            }

            // insert data order items
            $orderItems = OrderItem::create($data);
---
INSERT INTO `order_items` (`order_id`, `user_id`, `product_id`, `product_variant_id`, `order_product_id`, `quantity`, `total_price_item`, `order_item_status`, `retur`, `price`, `updated_at`, `created_at`) VALUES (2, '5', 14, 18, 3, 1, 46200, 'belum bayar', '0', 46200, '2022-10-24 14:38:50', '2022-10-24 14:38:50')

            // echo "<br><br>";
            if (!is_null($request->promo_use_id)) {
                // dd($promo);
                $productPromo = ProductPromo::whereIn('product_id', $request->product_ids)->get();
---
SELECT * FROM `product_promos` WHERE `product_id` in ('14')

                            } else {
                                $orderItems->discount = 0;
                            }
                            $order->save();
                            $orderItems->save();
---
UPDATE `orders` SET `discount` = 462, `orders`.`updated_at` = '2022-10-24 14:38:50' WHERE `id` = 2
UPDATE `order_items` SET `discount` = 462, `order_items`.`updated_at` = '2022-10-24 14:38:50' WHERE `id` = 3

                            $discount = $promo->discount;
                        }
                        $order->discount = $discount;
                        $order->save();
                    }
                    $userPromoUse->promo_use += 1;
                    $userPromoUse->save();
---
UPDATE `orders` SET `discount` = 7395, `orders`.`updated_at` = '2022-10-24 14:26:32' WHERE `id` = 1
UPDATE `user_promo_uses` SET `promo_use` = 1, `user_promo_uses`.`updated_at` = '2022-10-24 14:38:50' WHERE `id` = 2

            $promo_name = $promo->name;
            $promo_type = $promo->promoType->name;

            $userPromoOrderUse = UserPromoOrderUse::create([
                'user_id' => auth()->user()->id,
                'promo_id' => $promo->id,
                'order_id' => $order->id,
                'promo_name' => $promo_name,
                'promo_type' => $promo_type,
                'discount' => $order->discount,
            ]);
---
INSERT INTO `user_promo_order_uses` (`user_id`, `promo_id`, `order_id`, `promo_name`, `promo_type`, `discount`, `updated_at`, `created_at`) VALUES (5, 13, 2, 'Diskon Sarung Tangan Mekanik Kimberly ClarK KLEENGUARD G40 Polyurethane Coated 1% Min. Transaksi Rp46.200', 'Diskon persen (%) per item', 462, '2022-10-24 14:38:50', '2022-10-24 14:38:50')


        // menghapus cart item menggunakan fitur soft deletes agar dapat di retrieve kembali jika orde tidak dibayarkan
        foreach ($request->cart_ids as $ids) {
            $deleteCartItem = CartItem::where('id', $ids)->delete();
---
UPDATE `cart_items` SET `deleted_at` = '2022-10-24 14:38:50', `cart_items`.`updated_at` = '2022-10-24 14:38:50' WHERE `id` = '4' and `cart_items`.`deleted_at` IS NULL

            'user_id' => auth()->user()->id,
            'slug' => auth()->user()->username . '-' . $order->id . '-pesanan-berhasil-dibuat',
            'type' => 'Pesanan',
            'description' => '<p>Pesanan kamu berhasil dibuat. Produk yang kamu pesan berjumlah ' . $order->orderitem->count() . ' item.</p>',
---
SELECT * FROM `order_items` WHERE `order_items`.`order_id` = 2 and `order_items`.`order_id` IS not NULL

            'is_read' => 0
        ];
        // membuat notifikasi pembuatan pesanan untuk user
        $notification = UserNotification::create($notifications);
---
INSERT INTO `user_notifications` (`user_id`, `slug`, `type`, `description`, `excerpt`, `image`, `is_read`, `updated_at`, `created_at`) VALUES (5, 'rdnndr-2-pesanan-berhasil-dibuat', 'Pesanan', '<p>Pesanan kamu berhasil dibuat. Produk yang kamu pesan berjumlah 1 item.</p>', 'Pesanan kamu berhasil dibuat', 'storage/user/rdnndr/order/2/3/63564109dd6b0.jpg', 0, '2022-10-24 14:38:50', '2022-10-24 14:38:50')

    public function show($id)
    {
        $this->expiredCheck();
        // dd($id);
        $order = Order::withTrashed()->find($id);
---
SELECT * FROM `orders` WHERE `orders`.`id` = '1' LIMIT 1

    public function paymentCompleted(Request $request)
    {
        $this->expiredCheck();
        // dd($request);
        $validatedData = $request->validate(
            [
                'proof_of_payment' => 'image|file||mimes:jpeg,png,jpg|max:2048'
            ],
            [
                'proof_of_payment.image' => 'Bukti Pembayaran harus berupa gambar',
                'proof_of_payment.file' => 'Bukti Pembayaran harus berupa file',
                'proof_of_payment.mimes' => 'Bukti Pembayaran harus memiliki format file .jpg, .jpeg, .png',
                'proof_of_payment.max' => 'Bukti Pembayaran berukuran maximal 2MB',
            ]
        );

        $order = Order::where('id', '=', $request->order_id)->first();

        $stockVariant = 0;
        $soldVariant = 0;
        foreach ($order->orderitem as $orderitem) {
            $product = Product::where('id', '=', $orderitem->product_id)->first();
            if (!empty($orderitem->product_variant_id)) {
                $productVariantId = ProductVariant::where('id', '=', $orderitem->product_variant_id)->first();
---
SELECT * FROM `orders` WHERE `id` = '2' and `orders`.`deleted_at` IS NULL LIMIT 1
SELECT * FROM `order_items` WHERE `order_items`.`order_id` = 2 and `order_items`.`order_id` IS not NULL
SELECT * FROM `products` WHERE `id` = 14 LIMIT 1
SELECT * FROM `product_variants` WHERE `id` = 18 LIMIT 1

                // echo "<br>";
                $stockVariant += $productVariantId->stock;
                $soldVariant += $productVariantId->sold;
                $productVariantId->save();
---
UPDATE `product_variants` SET `sold` = 4, `stock` = 96, `product_variants`.`updated_at` = '2022-10-24 15:13:04' WHERE `id` = 18

            if (count($product->productvariant) > 0) {
                // echo ('ada product variant');
                // echo "<br>";
                $product->stock = $product->productvariant->sum('stock');
                $product->sold = $product->productvariant->sum('sold');
                $product->save();
---
SELECT * FROM `product_variants` WHERE `product_variants`.`product_id` = 14 and `product_variants`.`product_id` IS not NULL
UPDATE `products` SET `stock` = 186, `sold` = 14, `products`.`updated_at` = '2022-10-24 15:13:04' WHERE `id` = 14

        // dd(Order::orderBy('invoice_no','desc')->whereNotNull('invoice_no')->pluck('invoice_no')->first());


        if (Order::withTrashed()->whereNotNull('invoice_no')->exists()) {
            // dd(Order::where('invoice_no','like','%0822%')->max('invoice_no'));
            // $lastInvNo = Order::orderBy('invoice_no', 'desc')->whereNotNull('invoice_no')->pluck('invoice_no')->first();
            $lastInvNo = Order::withTrashed()->where('invoice_no', 'like', '%' . date('my') . '%')->max('invoice_no');
---
SELECT exists(SELECT * FROM `orders` WHERE `invoice_no` IS not NULL and `orders`.`deleted_at` IS NULL) as `exists`
SELECT max(`invoice_no`) as aggregate FROM `orders` WHERE `invoice_no` like '%1022%'

            $validatedData['proof_of_payment'] = $request->file('proof_of_payment')->store($folderPathSave);
            // echo $validatedData['proof_of_payment'];
        }
        $order = Order::where('id', '=', $request->order_id)->first();
---
SELECT * FROM `orders` WHERE `id` = '2' and `orders`.`deleted_at` IS NULL LIMIT 1

        $order->proof_of_payment = $validatedData['proof_of_payment'];
        $order->invoice_no = $noInv;
        $order->order_status = 'pesanan dibayarkan';
        $orderSave = $order->save();

        if ($orderSave) {
            foreach ($order->orderitem as $item) {
                $item->order_item_status = 'pesanan dibayarkan';
                $item->save();
            }
        }

        $orderStatus = OrderStatusDetail::create(
            [
                'order_id' => $order->id,
                'status' => 'pesanan dibayarkan',
                'status_detail' => 'Menunggu Verifikasi Pembayaran oleh Admin KLIKSPL',
                'status_date' => date('Y-m-d H:i:s')
            ]
        );
---
UPDATE `orders` SET `invoice_no` = 'SPL/INVC/KLIKSPL/000002/1022', `order_status` = 'pesanan dibayarkan', `proof_of_payment` = 'user/rdnndr/order/2/proof-of-payment/0YHpXmxeoRhwcFe0X3Hf18EikuGtCqGLHO3QPo6I.jpg', `orders`.`updated_at` = '2022-10-24 15:13:04' WHERE `id` = 2
SELECT * FROM `order_items` WHERE `order_items`.`order_id` = 2 and `order_items`.`order_id` IS not NULL
UPDATE `order_items` SET `order_item_status` = 'pesanan dibayarkan', `order_items`.`updated_at` = '2022-10-24 15:13:04' WHERE `id` = 3
INSERT INTO `order_status_details` (`order_id`, `status`, `status_detail`, `status_date`, `updated_at`, `created_at`) VALUES (2, 'pesanan dibayarkan', 'Menunggu Verifikasi Pembayaran oleh Admin KLIKSPL', '2022-10-24 15:13:04', '2022-10-24 15:13:04', '2022-10-24 15:13:04')

    public function paymentOrderBind($id)
    {
        $id = Crypt::decrypt($id);
        $this->expiredCheck();

        $order = Order::where('id', $id)->with(['orderitem', 'orderstatusdetail'])->first();
        // dd($order->orderitem[0]->product);

        if (!is_null($order->invoice_no)) {
            return redirect()->route('order.index');
        }
        // $now = Carbon::now();
        // echo $now;
        // echo "<br><br>";
        // $due_date = Carbon::createFromFormat('Y-m-d H:s:i', $order->payment_due_date);
        // echo $due_date;
        // echo "<br><br>";
        // if ($due_date > $now) {
        //     dd('telat');
        // }
        foreach ($order->orderitem as $item) {
            $orderProductIds[] = $item->orderproduct->id;
        }
        $orders = Order::where('id', $order->id)->with(['orderitem', 'orderstatusdetail', 'paymentmethod', 'orderaddress'])->get();
        $orderItems = $order->orderitem;
        $orderProducts = OrderProduct::whereIn('id', $orderProductIds)->with(['orderitem', 'orderproductimage'])->get();
---
SELECT * FROM `order_items` WHERE `order_items`.`order_id` in (3)
SELECT * FROM `order_status_details` WHERE `order_status_details`.`order_id` in (3)
SELECT * FROM `orders` WHERE `id` = '3' and `orders`.`deleted_at` IS NULL LIMIT 1
SELECT * FROM `order_products` WHERE `order_products`.`id` = 4 LIMIT 1
SELECT * FROM `order_addresses` WHERE `order_addresses`.`id` in (1)
SELECT * FROM `orders` WHERE `id` = 3 and `orders`.`deleted_at` IS NULL
SELECT * FROM `order_items` WHERE `order_items`.`order_product_id` in (4)
SELECT * FROM `order_product_images` WHERE `order_product_images`.`order_product_id` in (4)
SELECT * FROM `order_products` WHERE `id` in (4)

    public function orderDetailBind($id)
    {
        $id = Crypt::decrypt($id);
        $this->expiredCheck();

        // dd($order->id);
        $order = Order::withTrashed()->where('id', $id)->first();
        foreach ($order->orderitem as $item) {
            $orderProductIds[] = $item->orderproduct->id;
        }
        $orders = Order::withTrashed()->where('id', $id)->get();
        // dd($orders);
        $orderItems = $order->orderitem;
        $orderProducts = OrderProduct::whereIn('id', $orderProductIds)->get();
---
SELECT * FROM `orders` WHERE `id` = '3' LIMIT 1
SELECT * FROM `order_items` WHERE `order_items`.`order_id` = 3 and `order_items`.`order_id` IS not NULL
SELECT * FROM `order_products` WHERE `order_products`.`id` = 4 LIMIT 1
SELECT * FROM `orders` WHERE `id` = '3'
SELECT * FROM `order_products` WHERE `id` in (4)

    public function expiredCheck()
    {
        $now = Carbon::now();

        $orders = Order::where('user_id', '=', auth()->user()->id)->withTrashed()->orderByDesc('created_at')->get();
---
SELECT * FROM `orders` WHERE `user_id` = 5 ORDER BY `created_at` DESC

    public function orderProductDetail($id, OrderItem $orderItem)
    {
        // dd($orderItem);
        $orderProduct = $orderItem->orderProduct;
        // dd($orderProduct);
        $id = Crypt::decrypt($id);
        // dd($id);
        // $orderProduct = Crypt::decrypt($orderProduct);
        $order = Order::find($id);
        // dd($order);
        // dd($orderProduct);
        $city_origin = '36';
        $Key = 'product-' . $orderProduct->id;
        // if (!Session::has($Key)) {

        //     DB::table('products')
        //         ->where('id', $orderProduct->id)
        //         ->increment('view', 1);
        //     Session::put($Key, 1);
        // }
        // print_r(Session::all());
        $stock = 0;

        $stock = $orderProduct->stock;

        $product = $orderItem->product;
        // $orderProduct = Product::find($orderProduct->id);
        // $origin =  ProductOrigin::where('product_id', '=', $orderProduct->id)->with('city')->groupBy('sender_address_id')->get();
        // $orderProduct->productorigin->with('senderAddress')->unique('sender_address_id');
        $senderAddress = SenderAddress::where('is_active', '=', 1)->with('city')->get();
---
SELECT * FROM `order_products` WHERE `order_products`.`id` = 1 LIMIT 1
SELECT * FROM `orders` WHERE `orders`.`id` = 1 and `orders`.`deleted_at` IS NULL LIMIT 1
SELECT * FROM `cities` WHERE `cities`.`city_id` in (36, 206, 387)
SELECT * FROM `sender_addresses` WHERE `is_active` = 1

    public function orderCancellationRequest(Request $request, Order $order)
    {
        // dd($order);
        // dd($request->order_cancellation_request);
        $order->order_status = 'pengajuan pembatalan';
        $order->save();
        if ($order->save()) {
            foreach ($order->orderitem as $item) {
                $item->order_item_status = 'pengajuan pembatalan';
                $item->save();
            }
            // $order->delete();
            $orderStatus = OrderStatusDetail::create(
                [
                    'order_id' => $order->id,
                    'status' => 'pengajuan pembatalan',
                    'status_detail' => 'Proses pengajuan pembatalan pesanan. Alasan pembatalan: ' . $request->order_cancellation_request,
                    'status_date' => date('Y-m-d H:i:s')
                ]
            );
---
UPDATE `orders` SET `order_status` = 'pengajuan pembatalan', `orders`.`updated_at` = '2022-10-24 15:22:57' WHERE `id` = 2
SELECT * FROM `order_items` WHERE `order_items`.`order_id` = 26 and `order_items`.`order_id` IS not NULL
UPDATE `order_items` SET `order_item_status` = 'pengajuan pembatalan', `order_items`.`updated_at` = '2022-10-24 15:22:57' WHERE `id` = 3
INSERT INTO `order_status_details` (`order_id`, `status`, `status_detail`, `status_date`, `updated_at`, `created_at`) VALUES (2, 'pengajuan pembatalan', 'Proses pengajuan pembatalan pesanan. Alasan pembatalan: ', '2022-10-24 15:22:57', '2022-10-24 15:22:57', '2022-10-24 15:22:57')