app/Http/Controllers/OrderItemRatingController.php


        $folderPathSave = 'user/' . auth()->user()->username . '/order/' . $request->order_id . '/comment';

        $productComment = ProductComment::create(
            [
                'user_id' => $validatedData['user_id'],
                'product_id' => $validatedData['product_id'],
                'product_variant_id' => $validatedData['product_variant_id'],
                'comment' => $validatedData['comment'],
                'star' => $validatedData['star'],
                'comment_date' => $validatedData['comment_date'],
                'order_id' => $validatedData['order_id'],
                'deadline_to_comment' => $validatedData['deadline_to_comment'],
                'is_edit' => 0,
            ]
        );
---
INSERT INTO `product_comments` (`user_id`, `product_id`, `product_variant_id`, `comment`, `star`, `comment_date`, `order_id`, `deadline_to_comment`, `is_edit`, `updated_at`, `created_at`) VALUES ('5', '2', '4', 'amazing', '4', '2022-11-24', '21', '2022-12-24', 0, '2022-11-24 14:50:32', '2022-11-24 14:50:32')


        if ($productComment) {
            if ($request->file('comment_image')) {
                $uploadCommentImage = ProductComment::find($productComment->id);
                $uploadCommentImage->comment_image = $request->file('comment_image')->store($folderPathSave);
                $uploadCommentImage->save();
            }

            $orderItem = OrderItem::find($validatedData['id']);
            $orderItem->is_review = 1;
            $updateOrderItem = $orderItem->save();
---
SELECT * FROM `product_comments` WHERE `product_comments`.`id` = 43 LIMIT 1
UPDATE `product_comments` SET `comment_image` = 'user/rdnndr/order/21/comment/bIVZwXgEN5lab17MakHvPRbdkgHsXfvO96OwOWuD.jpg', `product_comments`.`updated_at` = '2022-11-24 14:50:32' WHERE `id` = 43
SELECT * FROM `order_items` WHERE `order_items`.`id` = '29' LIMIT 1
UPDATE `order_items` SET `is_review` = 1, `order_items`.`updated_at` = '2022-11-24 14:50:33' WHERE `id` = 29