app/Http/Controllers/ProductController.php

    public function index()
    {
        // dd(request());
        // if(request('sortby')){
        //     dd(request('sortby'));
        // }

        $products = Product::latest()->where('is_active','=',1)->with('productcomment')->addSelect(['star'=> ProductComment::selectRaw('avg(star)')->where('star','!=','0')->whereColumn('product_id','products.id')])->orderByDesc(ProductComment::selectRaw('avg(star)')->where('star','!=','0')->whereColumn('product_id','products.id'))->filter(request(['keyword','category','merk','sortby']))->paginate(80)->withquerystring();

        $promos = array();
        foreach ($products as $i => $product) {
            $key = 0;
            foreach ($product->productpromo as $j => $productPromo) {
                if ($productPromo->promo->is_active == 1) {
                    $promos[$i] = ((object)['id' =>$product->id,'promoActive' => $key+1]);
                    $key +=1;
                }
            }
        }
        // dd($products);
        return view('products', [
            'title' => 'Semua Produk',
            'active' => 'products',
            'products' => $products,
            'promos' => $promos,
            'categories' => ProductCategory::all(),
        ]);
---
SELECT `products`.*, (SELECT avg(star) FROM `product_comments` WHERE `star` != '0' and `product_id` = `products`.`id`) as `star` FROM `products` WHERE `is_active` = 1 ORDER BY `created_at` DESC, (SELECT avg(star) FROM `product_comments` WHERE `star` != '0' and `product_id` = `products`.`id`) DESC LIMIT 80 offset 0
SELECT * FROM `promos` WHERE `promos`.`id` = 4 LIMIT 1
SELECT * FROM `product_categories`

    public function show(Product $product)
    {
        $city_origin = '36';
        $Key = 'product-' . $product->id;
        if (!Session::has($Key)) {

            DB::table('products')
                ->where('id', $product->id)
                ->increment('view', 1);
            Session::put($Key, 1);
        }
        // print_r(Session::all());
        $stock = 0;
        if (count($product->productvariant) > 0) {
            foreach ($product->productVariant as $variant) {
                if($variant->stock > 0){
                    $stock += $variant->stock;
                }
            }
        } else {
            $stock = $product->stock;
        }

        $product = Product::find($product->id);
        $origin =  ProductOrigin::where('product_id','=',$product->id)->with('city')->groupBy('sender_address_id')->get();
        // $product->productorigin->with('senderAddress')->unique('sender_address_id');
        $senderAddress = SenderAddress::where('is_active','=',1)->with('city')->get();
---
SELECT * FROM `product_variants` WHERE `product_variants`.`product_id` = 3 and `product_variants`.`product_id` IS not NULL
SELECT * FROM `products` WHERE `products`.`id` = 3 LIMIT 1
SELECT * FROM `cities` WHERE `cities`.`city_id` in (36, 206)
SELECT * FROM `product_origins` WHERE `product_id` = 3 GROUP BY `sender_address_id`
SELECT * FROM `cities` WHERE `cities`.`city_id` in (36, 206, 387)
SELECT * FROM `sender_addresses` WHERE `is_active` = 1

            'active' => 'products',
            "product" => $product,
            "stock" => $stock,
            "comments" => ProductComment::where('product_id', $product->id)->with('user','children')->get(),
            "star" => ProductComment::where('product_id','=',$product->id)->where('star','!=','0')->avg('star'),
            "count_comments" => ProductComment::where('product_id','=',$product->id)->where('star','!=','0')->count(),
            "provinces" => Province::pluck('name', 'province_id'),
            "from_city" => City::where('city_id','=',$city_origin)->first(),
---
SELECT * FROM `product_comments` WHERE `product_id` = 3
SELECT * FROM `users` WHERE `users`.`id` in (5)
SELECT avg(`star`) as aggregate FROM `product_comments` WHERE `product_id` = 3 and `star` != '0'
SELECT count(*) as aggregate FROM `product_comments` WHERE `product_id` = 3 and `star` != '0'
SELECT `name`, `province_id` FROM `provinces`
SELECT * FROM `cities` WHERE `city_id` = '36' LIMIT 1