app/Http/Controllers/userProfileController.php

    public function index()
    {

        $user = User::find(auth()->user()->id);
---
SELECT * FROM `users` WHERE `users`.`id` = 6 LIMIT 1

    public function uploadProfileImage(Request $request)
    {
        // dd($request);
        $user = User::find($request->user_id);

        $folderPathSave = 'user/' . $user->username . '/profile/';
        $image_parts = explode(";base64,", $request->profile_image);
        $image_type_aux = explode("image/", $image_parts[0]);
        $image_type = $image_type_aux[1];
        $image_base64 = base64_decode($image_parts[1]);

        $imageName = uniqid() . '.jpg';

        $imageFullPathSave = $folderPathSave . $imageName;

        $previousProfileImage = $user->profile_image;
        if ($previousProfileImage) {
            Storage::delete($previousProfileImage);
        }

        $save = Storage::put($imageFullPathSave, $image_base64);
        $updateProfileImage = User::firstwhere('id', '=', auth()->user()->id)->update(['profile_image' => $imageFullPathSave]);
---
SELECT * FROM `users` WHERE `users`.`id` = '6' LIMIT 1
SELECT * FROM `users` WHERE `id` = 6 LIMIT 1
UPDATE `users` SET `profile_image` = 'user/riduanindra/profile/638070e354322.jpg', `users`.`updated_at` = '2022-11-25 14:38:11' WHERE `id` = 6