app/Http/Controllers/UserPromoController.php

    public function index()
    {
        $promo = Promo::where('is_active',1)->orderBy('end_period')->get();
---
SELECT * FROM `promos` WHERE `is_active` = 1 ORDER BY `end_period` ASC