app/Http/Controllers/UserNotificationController.php

    public function index()
    {
        // dd( UserNotification::where('user_id', auth()->user()->id)->get());
        // return view('userNotification.index', [
        $notifications = UserNotification::latest()->where('user_id', auth()->user()->id)->get();
        return view('userNotification.index', [
            'title' => 'Notifikasi',
            'active' => 'notification',
            'notifications' => $notifications
        ]);
    }

    /**
     * Show the form for creating a new resource.
     *
     * @return \Illuminate\Http\Response
     */
    public function create()
    {
        //
    }

    /**
     * Store a newly created resource in storage.
     *
---
SELECT * FROM `user_notifications` WHERE `user_id` = 5 ORDER BY `created_at` DESC