app/Http/Controllers/Admin/WarehouseLogistic/WarehouseLogisticHomeController.php

    public function index(Request $request)
    {
        // dd(Order::where('order_status','=', 'pesanan disiapkan')->get());
        return view('admin.home',[
            'title' => 'Admin Dashboard',
            'active' => 'dashboard',
            'cartItems' => CartItem::all(),
            'waitingPayment' => Order::where('order_status','=', 'belum bayar')->where(['sender_address_id' => function($query){
                $query->select('sender_address_id')
                ->from('admin_sender_addresses')
                ->whereColumn('sender_address_id', 'orders.sender_address_id')
                ->where('admin_id','=', auth()->guard('adminMiddle')->user()->id);
            }])->get(),
---
SELECT * FROM `cart_items` WHERE `cart_items`.`deleted_at` IS NULL
SELECT `id`, sum(courier_price + total_price + unique_code - discount) as total_income_per_month, (payment_method_id) as payment_method, DATE_FORMAT(updated_at, '%Y-%m') as month_year_income FROM `orders` WHERE `order_status` like '%selesai%' and `orders`.`deleted_at` IS NULL GROUP BY DATE_FORMAT(updated_at, '%Y-%m') ORDER BY `updated_at` ASC

                ->whereColumn('sender_address_id', 'orders.sender_address_id')
                ->where('admin_id','=', auth()->guard('adminMiddle')->user()->id);
            }])->where('order_status','=', 'expired')->orWhere('order_status','=', 'pesanan dibatalkan')->get(),
            'outStock' => Product::with(['productvariant' => fn ($query) => $query->where('stock', '=', '0')])
            ->whereHas(
                'productvariant',
                fn ($query) =>
                $query->where('stock', '=', '0')
            )->orWhere('stock','=','0')
            ->get(),
            'activedPromo' => Promo::where('is_active','=',1)->get(),
            'orderStatistics' => Order::all(),
---
SELECT * FROM `products` WHERE exists (SELECT * FROM `product_variants` WHERE `products`.`id` = `product_variants`.`product_id` and `stock` = '0') or `stock` = '0'
SELECT * FROM `promos` WHERE `is_active` = 1
SELECT * FROM `orders` WHERE `orders`.`deleted_at` IS NULL