app/Providers/AppServiceProvider.php

SELECT * FROM `users` WHERE `id` = 5 LIMIT 1
SELECT * FROM `cart_items` WHERE `user_id` = 5 and `cart_items`.`deleted_at` IS NULL
SELECT * FROM `product_variants` WHERE `product_variants`.`id` in (0, 3, 4, 7, 8, 9)
SELECT * FROM `products` WHERE `products`.`id` in (2, 3, 17, 22)
SELECT * FROM `user_notifications` WHERE `user_id` = 5 and `is_read` = '0'
SELECT * FROM `orders` WHERE (`user_id` = 5 and `order_status` != 'selesai') and `orders`.`deleted_at` IS NULL
SELECT * FROM `orders`
---
    public function boot()
    {
        Paginator::useBootstrap();

        // config(['app.locale' => 'id']);
        // Carbon::setLocale('id');
        // date_default_timezone_set('Asia/Jakarta');

        $categories = ProductCategory::all();
        $partialCategories = ProductCategory::take(12)->get();
        View::share('categories', $categories);
        View::share('partialCategories', $partialCategories);

        $merks = ProductMerk::all();
        $partialMerks = ProductMerk::take(12)->get();
        View::share('merks', $merks);
        View::share('partialMerks', $partialMerks);

        view()->composer('*', function ($view) {
            if (Auth::check()) {
                $view->with('userCartItems', CartItem::where('user_id', auth()->user()->id)->with(['product', 'productvariant'])->get()->sortByDesc('created_at'));
                $view->with('userNotifications', UserNotification::where('user_id', auth()->user()->id)->where('is_read', '=', '0')->get()->sortByDesc('created_at'));
                $view->with('userOrders', Order::where([['user_id' ,'=', auth()->user()->id], ['order_status', '!=', 'selesai']])->get()->sortByDesc('created_at'));

                // $view->with('userNotifications',UserNotification::where('user_id',auth()->user()->id)->get());
            }
        });
        view()->composer('*', function($view){
            if(auth::guard('adminMiddle')->check()){
                if(auth()->guard('adminMiddle')->user()->admin_type == 1){
                    $view->with('adminNotifications',AdminNotification::where('is_read', '=', '0')->get()->sortByDesc('created_at'));
                }elseif(auth()->guard('adminMiddle')->user()->admin_type == 2){
                    $view->with('adminNotifications',AdminNotification::where('is_read', '=', '0')->where('company_id', auth()->guard('adminMiddle')->user()->company_id)->get()->sortByDesc('created_at'));
                }elseif(auth()->guard('adminMiddle')->user()->admin_type == 3){
                    $view->with('adminNotifications',AdminNotification::where('is_read', '=', '0')->where('admin_type','=',auth()->guard('adminMiddle')->user()->admin_type)->get()->sortByDesc('created_at'));
                }else{
                    $view->with('adminNotifications',AdminNotification::where('is_read', '=', '0')->where('admin_type','=',auth()->guard('adminMiddle')->user()->admin_type)->where('company_id', auth()->guard('adminMiddle')->user()->company_id)->get()->sortByDesc('created_at'));
                }
            }
        });