app/Http/Controllers/Admin/AdminOrderController.php

    public function show($id)
    {
        // $this->isFinanceAndAdministrator();
        // dd($adminorder);
        $orders = Order::withTrashed()->find($id);
---
SELECT * FROM `orders` WHERE `orders`.`id` = '4' LIMIT 1

    public function expiredCheck()
    {
        // dd(auth()->guard('adminMiddle')->user());

        $now = Carbon::now();

        $orders = Order::withTrashed()->orderByDesc('created_at')->get();
---
SELECT * FROM `orders` ORDER BY `created_at` DESC