app/Http/Controllers/Admin/AdminOrderController.php

SELECT count(*) as aggregate FROM `orders` WHERE (`order_status` like '%pesanan dikirim%') and (`sender_address_id` = (SELECT `sender_address_id` FROM `admin_sender_addresses` WHERE `sender_address_id` = `orders`.`sender_address_id` and `admin_id` = 3))
SELECT * FROM `order_items` WHERE `order_items`.`order_id` in (23, 24, 27, 28, 31, 32, 33, 34)
SELECT * FROM `order_status_details` WHERE `order_status_details`.`order_id` in (23, 24, 27, 28, 31, 32, 33, 34)
SELECT * FROM `orders` WHERE (`order_status` like '%pesanan dibayarkan%' or `order_status` like '%upload ulang bukti pembayaran%') LIMIT 100 offset 0
SELECT count(*) as aggregate FROM `orders` WHERE (`order_status` like '%pesanan dibayarkan%' or `order_status` like '%upload ulang bukti pembayaran%')
---
        //     $orders =  Order::withTrashed()->with(['orderitem', 'orderstatusdetail'])->filterAdmin(request(['status', 'search', 'date_start', 'date_end', 'orderBy']))->paginate(100)->withquerystring();
        // } else
        if (auth()->guard('adminMiddle')->user()->admin_type == 2 || auth()->guard('adminMiddle')->user()->admin_type == 4) {
            $orders =  Order::withTrashed()->with(['orderitem', 'orderstatusdetail'])->filterAdmin(request(['status', 'search', 'date_start', 'date_end', 'orderBy']))->where(['sender_address_id' => function ($query) {
                $query->select('sender_address_id')
                    ->from('admin_sender_addresses')
                    ->whereColumn('sender_address_id', 'orders.sender_address_id')
                    ->where('admin_id', '=', auth()->guard('adminMiddle')->user()->id);
            }])->paginate(100)->withquerystring();
        } else {
            $orders =  Order::withTrashed()->with(['orderitem', 'orderstatusdetail'])->filterAdmin(request(['status', 'search', 'date_start', 'date_end', 'orderBy']))->paginate(100)->withquerystring();

SELECT * FROM `orders` WHERE `orders`.`id` = '16' LIMIT 1
SELECT * FROM `order_items` WHERE `order_id` = 16
SELECT * FROM `order_products` WHERE `order_products`.`id` = 24 LIMIT 1
---
    public function show($id)
    {
        // $this->isFinanceAndAdministrator();
        // dd($adminorder);
        $orders = Order::withTrashed()->find($id);
        // dd($orders);
        if (!is_null($orders)) {
            $status = session()->get('status');
            $orderItems = OrderItem::where('order_id', '=', $orders->id)->get();
            // dd($orderItems);
            // dd($adminorder);

            $weightGr = 0;
            foreach ($orderItems as $item) {
                $weightGr += ($item->quantity * $item->orderproduct->weight);

SELECT * FROM `orders` ORDER BY `created_at` DESC
---
    public function expiredCheck()
    {
        // dd(auth()->guard('adminMiddle')->user());

        $now = Carbon::now();

        $orders = Order::withTrashed()->orderByDesc('created_at')->get();

SELECT * FROM `order_items` WHERE `order_items`.`order_id` = 14 and `order_items`.`order_id` IS not NULL
SELECT * FROM `order_product_images` WHERE `order_product_images`.`order_product_id` = 6 and `order_product_images`.`order_product_id` IS not NULL
SELECT * FROM `order_products` WHERE `order_products`.`id` = 6 LIMIT 1
SELECT * FROM `cart_items` WHERE (`user_id` = 5 and `product_id` = 4 and `product_variant_id` = 0 and `quantity` = 2 and `subtotal` = 52600 and `deleted_at` like '%2022-11-17 08:34%' and `updated_at` like '%2022-11-17 08:34%') LIMIT 1
---
                // jika waktu delete sudah melebihi 24 jam / 1 hari
                if ($diff_in_hours > 24) {

                    foreach ($userOrder->orderItem as $orderItem) {
                        if ($orderItem->orderproduct->orderproductimage->count()) {
                            foreach ($orderItem->orderProduct->orderProductImage as $orderProductImage) {
                            }
                            $cartItem = CartItem::where([['user_id', '=', $orderItem->user_id], ['product_id', '=', $orderItem->product_id], ['product_variant_id', '=', $orderItem->product_variant_id], ['quantity', '=', $orderItem->quantity], ['subtotal','=', $orderItem->total_price_item], ['deleted_at','like','%'.Carbon::parse($orderItem->created_at)->format('Y-m-d H:i').'%'], ['updated_at','like','%'.Carbon::parse($orderItem->created_at)->format('Y-m-d H:i').'%']])->withTrashed()->first();

UPDATE `cart_items` SET `deleted_at` = , `cart_items`.`updated_at` = '2022-11-19 09:23:15' WHERE `id` = 21
---
                                // echo "cart item not null : ";
                                // echo "<br>";
                                $cartItem->deleted_at = NULL;
                                $cartItem->save();

SELECT * FROM `orders` WHERE `id` = '3' and `orders`.`deleted_at` IS NULL LIMIT 1
SELECT * FROM `order_items` WHERE `order_items`.`order_id` = 3 and `order_items`.`order_id` IS not NULL
---
    public function orderDetailBind($id)
    {
        // dd('ini detail');
        $this->isFinanceAndAdministrator();
        $this->expiredCheck();

        // dd($order->id);
        $order = Order::withTrashed()->where('id', $id)->first();
        foreach ($order->orderitem as $item) {

SELECT * FROM `orders` WHERE `id` = '22' and `orders`.`deleted_at` IS NULL LIMIT 1
SELECT * FROM `order_items` WHERE `order_items`.`order_id` = 22 and `order_items`.`order_id` IS not NULL
SELECT * FROM `products` WHERE `id` = 3 LIMIT 1
SELECT * FROM `product_variants` WHERE `id` = 9 LIMIT 1
---
    public function confirmPayment(Request $request)
    {
        $this->expiredCheck();
        // dd($request);
        $validatedData = $request->validate(
            [
                'proof_of_payment' => 'image|file||mimes:jpeg,png,jpg|max:2048'
            ],
            [
                'proof_of_payment.image' => 'Bukti Pembayaran harus berupa gambar',
                'proof_of_payment.file' => 'Bukti Pembayaran harus berupa file',
                'proof_of_payment.mimes' => 'Bukti Pembayaran harus memiliki format file .jpg, .jpeg, .png',
                'proof_of_payment.max' => 'Bukti Pembayaran berukuran maximal 2MB',
            ]
        );
        // dd($request);
        // dd($request->session()->get('status'));
        $order = Order::where('id', '=', $request->order_id)->first();
        if(is_null($order)){
            $order = Order::withTrashed()->where('id', '=', $request->order_id)->first();
        }
        $stockVariant = 0;
        $soldVariant = 0;
        foreach ($order->orderitem as $orderitem) {
            $product = Product::where('id', '=', $orderitem->product_id)->first();
            if (!empty($orderitem->product_variant_id)) {
                $productVariantId = ProductVariant::where('id', '=', $orderitem->product_variant_id)->first();

UPDATE `product_variants` SET `sold` = 10, `stock` = 90, `product_variants`.`updated_at` = '2022-11-24 14:34:53' WHERE `id` = 9
---
                // echo "<br>";
                $stockVariant += $productVariantId->stock;
                $soldVariant += $productVariantId->sold;
                $productVariantId->save();

SELECT * FROM `product_variants` WHERE `product_variants`.`product_id` = 3 and `product_variants`.`product_id` IS not NULL
UPDATE `products` SET `stock` = 470, `sold` = 25, `products`.`updated_at` = '2022-11-24 14:34:53' WHERE `id` = 3
---
            if (count($product->productvariant) > 0) {
                // echo ('ada product variant');
                // echo "<br>";
                $product->stock = $product->productvariant->sum('stock');
                $product->sold = $product->productvariant->sum('sold');
                $product->save();

SELECT exists(SELECT * FROM `orders` WHERE `invoice_no` IS not NULL) as `exists`
SELECT max(`invoice_no`) as aggregate FROM `orders` WHERE `invoice_no` like '%1122%'
---
        // dd(Order::orderBy('invoice_no','desc')->whereNotNull('invoice_no')->pluck('invoice_no')->first());


        if (Order::withTrashed()->whereNotNull('invoice_no')->exists()) {
            // dd(Order::where('invoice_no','like','%0822%')->max('invoice_no'));
            // $lastInvNo = Order::orderBy('invoice_no', 'desc')->whereNotNull('invoice_no')->pluck('invoice_no')->first();
            $lastInvNo = Order::withTrashed()->where('invoice_no', 'like', '%' . date('my') . '%')->max('invoice_no');

INSERT INTO `order_status_details` (`order_id`, `status`, `status_detail`, `status_date`, `updated_at`, `created_at`) VALUES (22, 'pesanan dibayarkan', 'Menunggu Verifikasi Pembayaran oleh Admin KLIKSPL', '2022-11-24 14:34:53', '2022-11-24 14:34:53', '2022-11-24 14:34:53')
---
                $item->save();
            }
        }
        $orderStatus = OrderStatusDetail::create(
            [
                'order_id' => $order->id,
                'status' => 'pesanan dibayarkan',
                'status_detail' => 'Menunggu Verifikasi Pembayaran oleh Admin KLIKSPL',
                'status_date' => date('Y-m-d H:i:s')
            ]
        );

UPDATE `orders` SET `order_status` = 'pembayaran dikonfirmasi', `orders`.`updated_at` = '2022-11-24 14:34:53' WHERE `id` = 22
---
        // $order = Order::where('id', '=', $request->order_id)->first();

        $order->order_status = 'pembayaran dikonfirmasi';
        $order->save();

UPDATE `order_items` SET `order_item_status` = 'pembayaran dikonfirmasi', `order_items`.`updated_at` = '2022-11-24 14:34:53' WHERE `id` = 30
INSERT INTO `order_status_details` (`order_id`, `status`, `status_detail`, `status_date`, `updated_at`, `created_at`) VALUES (22, 'pembayaran dikonfirmasi', 'Pembayaran telah dikonfirmasi oleh Admin KLIKSPL, pesanan anda akan segera disiapkan', '2022-11-24 14:34:53', '2022-11-24 14:34:53', '2022-11-24 14:34:53')
---
        if ($order->save()) {
            foreach ($order->orderitem as $item) {
                $item->order_item_status = 'pembayaran dikonfirmasi';
                $item->save();
            }
        }
        $orderStatus = OrderStatusDetail::create(
            [
                'order_id' => $order->id,
                'status' => 'pembayaran dikonfirmasi',
                'status_detail' => 'Pembayaran telah dikonfirmasi oleh Admin KLIKSPL, pesanan anda akan segera disiapkan',
                'status_date' => date('Y-m-d H:i:s')
            ]
        );

SELECT * FROM `orders` WHERE `id` = '31' and `orders`.`deleted_at` IS NULL LIMIT 1
UPDATE `orders` SET `order_status` = 'pesanan disiapkan', `orders`.`updated_at` = '2022-11-24 14:38:03' WHERE `id` = 31
SELECT * FROM `order_items` WHERE `order_items`.`order_id` = 31 and `order_items`.`order_id` IS not NULL
UPDATE `order_items` SET `order_item_status` = 'pesanan disiapkan', `order_items`.`updated_at` = '2022-11-24 14:38:04' WHERE `id` = 40
INSERT INTO `order_status_details` (`order_id`, `status`, `status_detail`, `status_date`, `updated_at`, `created_at`) VALUES (31, 'pesanan disiapkan', 'pesanan sedang disiapkan oleh Tim KLIKSPL', '2022-11-24 14:38:04', '2022-11-24 14:38:04', '2022-11-24 14:38:04')
---
    public function prepareOrder(Request $request)
    {
        // dd($request);
        // dd($request->session()->get('status'));
        $status = str_replace(" ", "+", $request->session()->get('status'));
        // dd($request);

        $order = Order::where('id', '=', $request->order_id)->first();

        $order->order_status = 'pesanan disiapkan';
        $order->save();
        if ($order->save()) {
            foreach ($order->orderitem as $item) {
                $item->order_item_status = 'pesanan disiapkan';
                $item->save();
            }
        }
        $orderStatus = OrderStatusDetail::create(
            [
                'order_id' => $order->id,
                'status' => 'pesanan disiapkan',
                'status_detail' => 'pesanan sedang disiapkan oleh Tim KLIKSPL',
                'status_date' => date('Y-m-d H:i:s')
            ]
        );

SELECT * FROM `orders` WHERE `orders`.`id` = '34' and `orders`.`deleted_at` IS NULL LIMIT 1
UPDATE `orders` SET `resi` = '1349T5U830TU250T', `orders`.`updated_at` = '2022-11-24 14:43:26' WHERE `id` = 34
INSERT INTO `order_status_details` (`order_id`, `status`, `status_detail`, `status_date`, `updated_at`, `created_at`) VALUES (34, 'Nomor resi telah terbit', 'Nomor Resi pesanan anda 1349T5U830TU250T', '2022-11-24 14:43:26', '2022-11-24 14:43:26', '2022-11-24 14:43:26')
---
    public function shippingReceiptUpload(Request $request)
    {
        // dd($request);
        $request->merge(['id' => $request->order_id]);
        $validatedData = $request->validate(
            [
                'id' => 'required',
                'resi' => 'required|unique:orders'
            ],
            [
                'resi.required' => 'Nomor Resi Wajid diisi!',
                'resi.unique' => 'Nomor Resi sudah digunakan, Nomor Resi harus unik!',
            ]
        );
        $order = Order::find($request->order_id);
        $order->resi = $validatedData['resi'];
        $update = $order->save();
        if ($update) {
            $orderStatus = OrderStatusDetail::create(
                [
                    'order_id' => $order->id,
                    'status' => 'Nomor resi telah terbit',
                    'status_detail' => 'Nomor Resi pesanan anda ' . $order->resi,
                    'status_date' => date('Y-m-d H:i:s')
                ]
            );