app/Http/Controllers/Admin/AdminProductController.php

SELECT * FROM `products` WHERE `company_id` = '1' ORDER BY `created_at` DESC
---
    public function index()
    {
        $this->isWhLogAndAdministrator();
        $currentURL = explode('/', url()->current());
        $currentPage = last($currentURL);
        Session::put('currentPage', $currentPage);

        $product = Product::latest()->where('company_id', '=', auth()->guard('adminMiddle')->user()->company_id)->get();