app/Http/Controllers/Admin/AdminPromoVoucherController.php

    public function index(Request $request)
    {
        $this->expiredCheck();
        // dd('index voucher');
        // dd('index voucher');
        if (empty(request(['status'])['status'])) {
            $request->request->add(['status' => '']);
        }
        if (request(['status'])['status'] == '') {
            $request->session()->put('status', '');
        } else if (request(['status'])['status'] == 'aktif') {
            $request->session()->put('status', 'aktif');
        } else if (request(['status'])['status'] == 'tidak aktif') {
            $request->session()->put('status', 'tidak aktif');
        } else if (request(['status'])['status'] == 'akan datang') {
            $request->session()->put('status', 'akan datang');
        } else if (request(['status'])['status'] == 'sudah berakhir') {
            $request->session()->put('status', 'sudah berakhir');
        } else {
            abort(404);
        }
        // dd(request(['status'])['status']);
        if(auth()->guard('adminMiddle')->user()->admin_type == 1){
            $promos = Promo::latest()->filterIndex(request(['status']))->get();
        }else{
            $promos = Promo::latest()->where('company_id', '=', auth()->guard('adminMiddle')->user()->company_id)->filterIndex(request(['status']))->get();
---
SELECT * FROM `promos` WHERE `company_id` = '1' ORDER BY `created_at` DESC

    public function expiredCheck()
    {
        // dd(auth()->guard('adminMiddle')->user()->company_id);
        $promoVoucher = Promo::where('company_id', '=', auth()->guard('adminMiddle')->user()->company_id)->get();
---
SELECT * FROM `promos` WHERE `company_id` = '1'