app/Http/Controllers/Admin/HomeController.php

                $query->select('order_id')->from(with(new OrderItem)->getTable())->where('is_review', '=', '1');
            })->get();

            $canceled = Order::withTrashed()->join('admin_sender_addresses', function ($join) {
                $join->on('orders.sender_address_id', '=', 'admin_sender_addresses.sender_address_id')
                    ->where('admin_sender_addresses.admin_id', '=', auth()->guard('adminMiddle')->user()->id);
            })->where('orders.order_status', '=', 'expired')
                ->orWhere('orders.order_status', '=', 'pesanan dibatalkan')
                ->get();
---
SELECT * FROM `orders` inner join `admin_sender_addresses` on `orders`.`sender_address_id` = `admin_sender_addresses`.`sender_address_id` and `admin_sender_addresses`.`admin_id` = 1 WHERE `orders`.`order_status` = 'expired' or `orders`.`order_status` = 'pesanan dibatalkan'

            // }])->where('order_status', '=', 'expired')->orWhere('order_status', '=',
            // 'pesanan dibatalkan')->get();

            $outStock = Product::where('company_id', '=', auth()->guard('adminMiddle')->user()->company_id)->with(['productvariant' => fn ($query) => $query->where('stock', '=', '0')])
                ->whereHas(
                    'productvariant',
                    fn ($query) =>
                    $query->where('stock', '=', '0')
                )->orWhere('stock', '=', '0')
                ->get();

            $activedPromo = Promo::where('company_id', '=', auth()->guard('adminMiddle')->user()->company_id)->where('is_active', '=', 1)->get();

            $activedBannerPromo = PromoBanner::where('company_id', '=', auth()->guard('adminMiddle')->user()->company_id)->where('is_active', '=', 1)->get();

            $productComments = ProductComment::whereNotNull('product_comments.user_id')
                ->join('orders', function ($join) {
                    $join->on('product_comments.order_id', '=', 'orders.id');
                })
                ->join('admin_sender_addresses', function ($join) {
                    $join->on('admin_sender_addresses.sender_address_id', '=', 'orders.sender_address_id');
                })
                ->join("admins", function ($join) {
                    $join->on("admins.id", "=", "admin_sender_addresses.admin_id")
                        ->where('admins.id', '=', auth()->guard('adminMiddle')->user()->id);
                })->get('product_comments.*');
---
SELECT * FROM `products` WHERE `company_id` = '1' and exists (SELECT * FROM `product_variants` WHERE `products`.`id` = `product_variants`.`product_id` and `stock` = '0') or `stock` = '0'
SELECT * FROM `promos` WHERE `company_id` = '1' and `is_active` = 1
SELECT * FROM `promo_banners` WHERE `company_id` = '1' and `is_active` = 1
SELECT `product_comments`.* FROM `product_comments` inner join `orders` on `product_comments`.`order_id` = `orders`.`id` inner join `admin_sender_addresses` on `admin_sender_addresses`.`sender_address_id` = `orders`.`sender_address_id` inner join `admins` on `admins`.`id` = `admin_sender_addresses`.`admin_id` and `admins`.`id` = 1 WHERE `product_comments`.`user_id` IS not NULL


        $incomeValues = Order::where('order_status', 'like', '%selesai%')->select(DB::raw('sum(courier_price + total_price + unique_code - discount) as total_income'))->first()->total_income;

        $incomeThisMonth = Order::where('order_status', 'like', '%selesai%')->whereYear('updated_at', '=', date('Y'))->whereMonth('updated_at', '=', date('m'))->select(DB::raw('sum(courier_price + total_price + unique_code - discount) as total_income'))->first()->total_income;
---
SELECT `id`, sum(courier_price + total_price + unique_code - discount) as total_income_per_month, (payment_method_id) as payment_method, DATE_FORMAT(updated_at, '%Y-%m') as month_year_income FROM `orders` WHERE `order_status` like '%selesai%' and `orders`.`deleted_at` IS NULL GROUP BY DATE_FORMAT(updated_at, '%Y-%m') ORDER BY `updated_at` ASC
SELECT sum(courier_price + total_price + unique_code - discount) as total_income FROM `orders` WHERE `order_status` like '%selesai%' and `orders`.`deleted_at` IS NULL LIMIT 1

            }
        }
        // dd($productComments->children);
        return view('admin.home', [
            'title' => 'Admin Dashboard',
            'active' => 'dashboard',
            'cartItems' => CartItem::all(),
            'waitingPayment' => $waitingPayment,
            'confirmPayment' => $confirmPayment,
            'mustBeProcess' => $mustBeProcess,
            'mustBeSent' => $mustBeSent,
            'onDelivery' => $onDelivery,
            'arrived' => $arrived,
            'finish' => $finish,
            'canceled' => $canceled,
            'outStock' => $outStock,
            'activedPromo' => $activedPromo,
            'activedBannerPromo' => $activedBannerPromo,
            'incomeValues' => $incomeValues,
            'incomeThisMonth' => $incomeThisMonth,
            'productCommentsCount' => $productCommentsCount,
            'orderStatistics' => Order::all(),
        ]);
---
SELECT * FROM `orders` WHERE `orders`.`deleted_at` IS NULL
SELECT * FROM `cart_items` WHERE `cart_items`.`deleted_at` IS NULL

    public function promoBannerExpiredCheck()
    {
        $expiredCheck = PromoBanner::all();
---
SELECT * FROM `promo_banners`

    public function promoVoucherExpiredCheck()
    {
        $expiredCheck = Promo::all();
---
SELECT * FROM `promos`